Revit 2024 API
StructuralSectionAnalysisParams Constructor
 Creates a new instance of StructuralSectionAnalysisParams.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public StructuralSectionAnalysisParams()
Visual Basic
Public Sub New
Visual C++
public:
StructuralSectionAnalysisParams()
See Also
StructuralSectionAnalysisParams Class
StructuralSectionAnalysisParams Overload
Autodesk.Revit.DB.Structure.StructuralSections Namespace